refactor: change the ascii code diagrams to mermaid diagrams
